unit_tests/cassandra-stress-user-l1-c0-k1-20251002_194328-3ca72551-0040-49ee-8474-89feb42a128b.log
[2025-10-02 19:43:32.533] TAG: loader_idx:1-cpu_idx:0-keyspace_idx:1
[2025-10-02 19:43:34.521] ******************** Stress Settings ********************
[2025-10-02 19:43:34.521] Command:
[2025-10-02 19:43:34.521]   Type: user
[2025-10-02 19:43:34.521]   Count: -1
[2025-10-02 19:43:34.522]   Duration: 1
[2025-10-02 19:43:34.522]  MINUTES
[2025-10-02 19:43:34.522]   No Warmup: true
[2025-10-02 19:43:34.522]   Consistency Level:
[2025-10-02 19:43:34.522] ONE
[2025-10-02 19:43:34.523]   Serial Consistency Level:
[2025-10-02 19:43:34.523] SERIAL
[2025-10-02 19:43:34.523]   Target Uncertainty: not applicable
[2025-10-02 19:43:34.523]   Command Ratios:
[2025-10-02 19:43:34.523] {insert=1.0, simple1=1.0}
[2025-10-02 19:43:34.524]   Command Clustering Distribution: clustering=gaussian(1..10)
[2025-10-02 19:43:34.524]   Profile File: /tmp/cassandra-stress-custom.yaml
[2025-10-02 19:43:34.524] Rate:
[2025-10-02 19:43:34.524]   Auto: false
[2025-10-02 19:43:34.525]   Thread Count: 1
[2025-10-02 19:43:34.525]   OpsPer Sec: 0
[2025-10-02 19:43:34.525] Population:
[2025-10-02 19:43:34.525]   Distribution: Gaussian:  min=1,max=1000000,mean=500000.500000,stdev=166666.500000
[2025-10-02 19:43:34.525]   Order: ARBITRARY
[2025-10-02 19:43:34.526]   Wrap: false
[2025-10-02 19:43:34.526] Insert:
[2025-10-02 19:43:34.526]   Revisits: Uniform:  min=1,max=1000000
[2025-10-02 19:43:34.526]   Visits: Fixed:  key=1
[2025-10-02 19:43:34.530]   Row Population Ratio: Ratio: divisor=1.000000;delegate=Fixed:  key=1
[2025-10-02 19:43:34.530]   Batch Type: not batching
[2025-10-02 19:43:34.530] Errors:
[2025-10-02 19:43:34.530]   Ignore: false
[2025-10-02 19:43:34.530]   Fail fast setting: false
[2025-10-02 19:43:34.530]   Tries: 10
[2025-10-02 19:43:34.530] Log:
[2025-10-02 19:43:34.530]   No Summary: false
[2025-10-02 19:43:34.530]   No Settings: false
[2025-10-02 19:43:34.530]   File: null
[2025-10-02 19:43:34.530]   Interval Millis: 1000
[2025-10-02 19:43:34.530]   Level: NORMAL
[2025-10-02 19:43:34.530] Mode:
[2025-10-02 19:43:34.530]   API: JAVA_DRIVER_NATIVE
[2025-10-02 19:43:34.530]   Connection Style: CQL_PREPARED
[2025-10-02 19:43:34.530]   CQL Version: CQL3
[2025-10-02 19:43:34.530]   Protocol Version: V4
[2025-10-02 19:43:34.530]   Username: cassandra
[2025-10-02 19:43:34.531]   Password: *suppressed*
[2025-10-02 19:43:34.531]   Auth Provide Class: null
[2025-10-02 19:43:34.531]   Max Pending Per Connection: null
[2025-10-02 19:43:34.531]   Connections Per Host: 8
[2025-10-02 19:43:34.531]   Compression: NONE
[2025-10-02 19:43:34.531] Node:
[2025-10-02 19:43:34.531]   Nodes: [172.17.0.2]
[2025-10-02 19:43:34.531]   Is White List: false
[2025-10-02 19:43:34.531]   Datacenter: null
[2025-10-02 19:43:34.531]   Rack: null
[2025-10-02 19:43:34.536] Schema:
[2025-10-02 19:43:34.536]   Keyspace: keyspace1
[2025-10-02 19:43:34.536]   Replication Strategy: org.apache.cassandra.locator.NetworkTopologyStrategy
[2025-10-02 19:43:34.536]   Replication Strategy Options: {replication_factor=1}
[2025-10-02 19:43:34.536]   Storage Options: {}
[2025-10-02 19:43:34.536]   Table Compression: null
[2025-10-02 19:43:34.536]   Table Compaction Strategy: null
[2025-10-02 19:43:34.536]   Table Compaction Strategy Options: {}
[2025-10-02 19:43:34.536] Transport:
[2025-10-02 19:43:34.536]   factory=org.apache.cassandra.thrift.TFramedTransportFactory; truststore=null; truststore-password=null; keystore=null; keystore-password=null; ssl-protocol=TLS; ssl-alg=SunX509; store-type=JKS; ssl-ciphers=TLS_RSA_WITH_AES_128_CBC_SHA,TLS_RSA_WITH_AES_256_CBC_SHA; hostname-verification=false;
[2025-10-02 19:43:34.536] Port:
[2025-10-02 19:43:34.536]   Native Port: 9042
[2025-10-02 19:43:34.536]   Thrift Port: 9160
[2025-10-02 19:43:34.536]   JMX Port: 7199
[2025-10-02 19:43:34.536] Send To Daemon:
[2025-10-02 19:43:34.536]   *not set*
[2025-10-02 19:43:34.536] Graph:
[2025-10-02 19:43:34.536]   File: null
[2025-10-02 19:43:34.536]   Revision: unknown
[2025-10-02 19:43:34.536]   Title: null
[2025-10-02 19:43:34.536]   Operation: USER
[2025-10-02 19:43:34.536] TokenRange:
[2025-10-02 19:43:34.536]   Wrap: false
[2025-10-02 19:43:34.536]   Split Factor: 1
[2025-10-02 19:43:34.536] CloudConf:
[2025-10-02 19:43:34.536]   File: null

[2025-10-02 19:43:34.536] ******************** Profile ********************
[2025-10-02 19:43:34.536]   Keyspace Name: keyspace1
[2025-10-02 19:43:34.536]   Keyspace CQL:
[2025-10-02 19:43:34.536] ***
[2025-10-02 19:43:34.536] CREATE KEYSPACE keyspace1 WITH replication = {'class': 'NetworkTopologyStrateg
[2025-10-02 19:43:34.537] y', 'replication_factor': 1};
[2025-10-02 19:43:34.537] ***

[2025-10-02 19:43:34.537]   Table Name: standard1
[2025-10-02 19:43:34.537]   Table CQL:
[2025-10-02 19:43:34.537] ***

[2025-10-02 19:43:34.538] CREATE TABLE standard1 (
[2025-10-02 19:43:34.538]       name text,
[2025-10-02 19:43:34.538]       choice boolean,
[2025-10-02 19:43:34.538]       date timestamp,
[2025-10-02 19:43:34.538]       address inet,
[2025-10-02 19:43:34.538]       dbl double,
[2025-10-02 19:43:34.538]       lval bigint,
[2025-10-02 19:43:34.538]       ival int,
[2025-10-02 19:43:34.538]       uid timeuuid,
[2025-10-02 19:43:34.538]       value blob,
[2025-10-02 19:43:34.538]       PRIMARY KEY((name,choice), date, address, dbl, lval, ival, uid)
[2025-10-02 19:43:34.538] ) WITH compaction = {'class': 'TimeWindowCompactionStrategy', 'compaction_window_unit': 'DAYS', 'compaction_window_size': 1}
[2025-10-02 19:43:34.538]   AND comment='A table of many types to test wide rows'
[2025-10-02 19:43:34.538] ***

[2025-10-02 19:43:34.538]   Extra Schema Definitions: null
[2025-10-02 19:43:34.538]   Generator Configs:
[2025-10-02 19:43:34.543]     date: Clustering: Uniform:  min=20,max=40;
[2025-10-02 19:43:34.543]     lval: Clustering: Uniform:  min=1,max=4;Identity: Gaussian:  min=1,max=1000,mean=500.500000,stdev=166.500000;
[2025-10-02 19:43:34.543]     name:
[2025-10-02 19:43:34.546] Size: Uniform:  min=1,max=10;Identity: Uniform:  min=1,max=1000000;
[2025-10-02 19:43:34.546]   Query Definitions:
[2025-10-02 19:43:34.546]     simple1: CQL:select * from standard1 where name = ? and choice = ? LIMIT 100;Fields:samerow;
[2025-10-02 19:43:34.546]     range1: CQL:select * from standard1 where name = ? and choice = ? and date >= ? LIMIT 100;Fields:multirow;
[2025-10-02 19:43:34.546]   Token Range Queries:
[2025-10-02 19:43:34.546]   Insert Settings:

    [2025-10-02 19:43:34.560] partitions
[2025-10-02 19:43:34.560] : uniform(1..50)
[2025-10-02 19:43:34.560]     batchtype: LOGGED
[2025-10-02 19:43:34.560]     select: uniform(1..10)/10
[2025-10-02 19:43:34.607] INFO  [main] 2025-10-02 10:43:34,597 GuavaCompatibility.java:204 - Detected Guava >= 19 in the classpath, using modern compatibility layer
[2025-10-02 19:43:34.646] INFO  [main] 2025-10-02 10:43:34,639 Cluster.java:279 - ScyllaDB Java Driver 3.11.5.7
[2025-10-02 19:43:34.811] INFO  [main] 2025-10-02 10:43:34,808 Native.java:113 - Could not load JNR C Library, native system calls through this library will not be available (set this logger level to DEBUG to see the full stack trace).
[2025-10-02 19:43:34.811] INFO  [main] 2025-10-02 10:43:34,810 Clock.java:60 - Using java.lang.System clock to generate timestamps.
[2025-10-02 19:43:34.918] INFO  [main] 2025-10-02 10:43:34,916 Cluster.java:194 - ===== Using optimized driver!!! =====
[2025-10-02 19:43:35.087] INFO  [main] 2025-10-02 10:43:35,085 NettyUtil.java:84 - Detected shaded Netty classes in the classpath; native epoll transport will not work properly, defaulting to NIO.
[2025-10-02 19:43:36.269] INFO  [main] 2025-10-02 10:43:36,267 DCAwareRoundRobinPolicy.java:110 - Using data-center name 'datacenter1' for DCAwareRoundRobinPolicy (if this is incorrect, please provide the correct datacenter name with DCAwareRoundRobinPolicy constructor)
[2025-10-02 19:43:36.273] INFO  [main] 2025-10-02 10:43:36,271 Cluster.java:1847 - New Cassandra host /172.17.0.2:9042 added
[2025-10-02 19:43:36.273] Connected to cluster: , max pending requests per connection null, max connections per host
[2025-10-02 19:43:36.274] 8
[2025-10-02 19:43:36.274] Datatacenter: datacenter1
[2025-10-02 19:43:36.274] ; Host: /172.17.0.2; Rack: rack1
[2025-10-02 19:43:36.314] INFO  [main] 2025-10-02 10:43:36,311 HostConnectionPool.java:200 - Using advanced port-based shard awareness with /172.17.0.2:9042
[2025-10-02 19:43:36.433] WARN  [cluster1-nio-worker-1] 2025-10-02 10:43:36,432 RequestHandler.java:303 - Query '[0 bound values] CREATE KEYSPACE keyspace1 WITH replication = {'class': 'NetworkTopologyStrategy', 'replication_factor': 1};' generated server side warning(s): Using Replication Factor replication_factor=1 lower than the minimum_replication_factor_warn_threshold=3 is not recommended.
[2025-10-02 19:43:36.542] Created schema. Sleeping 1s for propagation.
[2025-10-02 19:43:37.604] Generating batches with [1..50] partitions and [2..8000] rows (of [20..8000] total rows in the partitions)

[2025-10-02 19:43:37.605] Sleeping 2s...
[2025-10-02 19:43:39.618] Running [insert, simple1] with 1 threads 1 minutes
[2025-10-02 19:43:40.018] Failed to connect over JMX; not collecting these stats
[2025-10-02 19:43:40.027] type       total ops,    op/s,    pk/s,   row/s,    mean,     med,     .95,     .99,    .999,     max,   time,   stderr, errors,  gc: #,  max ms,  sum ms,  sdv ms,      mb
[2025-10-02 19:43:40.042] WARN  [cluster1-worker-5] 2025-10-02 10:43:40,040 DefaultPreparedStatement.java:205 - Prepared statement select * from standard1 where name = ? and choice = ? LIMIT 100 is a wildcard select, which can cause prepared statement invalidation issues when executed on CQL4. These issues may lead to broken deserialization or data corruption. To mitigate this, the driver ensures that the server returns metadata with each query for such statements, though this negatively impacts performance. To avoid this, consider using a targeted select instead. Alternatively, you can enable the skip-cql4-metadata-resolve-method option in the execution profile by setting it to `always-on`, allowing the driver to ignore this issue and proceed regardless, risking broken deserialization or data corruption.
[2025-10-02 19:43:40.048] WARN  [cluster1-worker-6] 2025-10-02 10:43:40,046 DefaultPreparedStatement.java:205 - Prepared statement select * from standard1 where name = ? and choice = ? and date >= ? LIMIT 100 is a wildcard select, which can cause prepared statement invalidation issues when executed on CQL4. These issues may lead to broken deserialization or data corruption. To mitigate this, the driver ensures that the server returns metadata with each query for such statements, though this negatively impacts performance. To avoid this, consider using a targeted select instead. Alternatively, you can enable the skip-cql4-metadata-resolve-method option in the execution profile by setting it to `always-on`, allowing the driver to ignore this issue and proceed regardless, risking broken deserialization or data corruption.
[2025-10-02 19:43:41.022] insert,          154,     154,    3868,    3868,     2.9,     2.5,     5.6,    13.6,    20.5,    20.5,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:41.025] simple1,         108,     108,       4,       9,     1.2,     1.1,     2.2,     2.6,     3.1,     3.1,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:41.029] total,           262,     262,    3872,    3877,     2.2,     1.7,     4.6,    10.6,    20.5,    20.5,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:42.007] insert,          467,     313,    7981,    7981,     1.5,     1.4,     3.0,     3.7,    11.8,    11.8,    2.0,  0.24503,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:42.010] simple1,         395,     287,      33,      79,     0.5,     0.4,     1.0,     1.3,     1.4,     1.4,    2.0,  0.24503,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:42.012] total,           862,     600,    8014,    8060,     1.1,     0.8,     2.6,     3.3,    11.8,    11.8,    2.0,  0.24503,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:43.006] insert,          777,     310,    8170,    8170,     1.6,     1.5,     2.8,     3.6,     6.7,     6.7,    3.0,  0.17183,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:43.006] simple1,         683,     288,      45,     150,     0.5,     0.5,     1.0,     1.3,     1.4,     1.4,    3.0,  0.17183,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:43.008] total,          1460,     598,    8215,    8320,     1.1,     0.8,     2.5,     3.4,     6.7,     6.7,    3.0,  0.17183,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:44.003] insert,         1100,     323,    8413,    8413,     1.5,     1.4,     2.8,     3.5,     5.2,     5.2,    4.0,  0.13217,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:44.004] simple1,        1050,     367,      59,     165,     0.4,     0.3,     0.9,     1.1,     1.3,     1.3,    4.0,  0.13217,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:44.004] total,          2150,     690,    8472,    8578,     0.9,     0.6,     2.2,     3.3,     5.2,     5.2,    4.0,  0.13217,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:45.003] insert,         1447,     347,    8915,    8915,     1.4,     1.3,     2.6,     3.8,     5.8,     5.8,    5.0,  0.11014,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:45.003] simple1,        1340,     290,      75,     252,     0.4,     0.3,     0.9,     1.3,     1.3,     1.3,    5.0,  0.11014,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:45.003] total,          2787,     637,    8990,    9167,     1.0,     0.8,     2.3,     3.2,     5.8,     5.8,    5.0,  0.11014,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:46.002] insert,         1799,     352,    9179,    9179,     1.4,     1.3,     2.5,     4.2,     9.2,     9.2,    6.0,  0.09517,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:46.002] simple1,        1665,     325,      74,     277,     0.4,     0.3,     0.8,     1.1,     1.2,     1.2,    6.0,  0.09517,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:46.003] total,          3464,     677,    9253,    9456,     0.9,     0.6,     2.2,     3.4,     9.2,     9.2,    6.0,  0.09517,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:47.002] insert,         2181,     382,    9955,    9955,     1.2,     1.2,     2.1,     2.7,     6.9,     6.9,    7.0,  0.08701,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:47.003] simple1,        2021,     356,     100,     351,     0.3,     0.3,     0.7,     0.9,     1.2,     1.2,    7.0,  0.08701,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:47.003] total,          4202,     738,   10055,   10306,     0.8,     0.6,     1.8,     2.4,     6.9,     6.9,    7.0,  0.08701,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:48.003] insert,         2539,     358,    8877,    8877,     1.3,     1.2,     2.4,     3.0,     7.5,     7.5,    8.0,  0.07624,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:48.004] simple1,        2446,     425,     119,     353,     0.3,     0.2,     0.7,     0.9,     6.2,     6.2,    8.0,  0.07624,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:48.005] total,          4985,     783,    8996,    9230,     0.8,     0.5,     2.1,     2.8,     7.5,     7.5,    8.0,  0.07624,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:49.002] insert,         2857,     318,    8512,    8512,     1.4,     1.3,     2.6,     3.2,     3.6,     3.6,    9.0,  0.06761,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:49.003] simple1,        2822,     376,     101,     388,     0.4,     0.4,     0.8,     1.1,     4.5,     4.5,    9.0,  0.06761,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:49.003] total,          5679,     694,    8613,    8900,     0.9,     0.6,     2.2,     3.0,     4.5,     4.5,    9.0,  0.06761,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:50.002] insert,         3081,     224,    5615,    5615,     2.2,     1.7,     5.8,     7.6,     8.7,     8.7,   10.0,  0.06871,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:50.003] simple1,        3020,     198,      65,     256,     0.8,     0.5,     1.6,     5.2,    28.9,    28.9,   10.0,  0.06871,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:50.003] total,          6101,     422,    5680,    5871,     1.5,     1.0,     4.4,     7.3,    28.9,    28.9,   10.0,  0.06871,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:51.003] insert,         3372,     291,    7357,    7357,     1.6,     1.5,     3.4,     4.1,     5.1,     5.1,   11.0,  0.06306,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:51.004] simple1,        3317,     297,      98,     338,     0.4,     0.3,     0.9,     1.7,     3.0,     3.0,   11.0,  0.06306,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:51.005] total,          6689,     588,    7455,    7695,     1.0,     0.7,     3.0,     4.0,     5.1,     5.1,   11.0,  0.06306,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:52.003] insert,         3746,     374,    9845,    9845,     1.2,     1.2,     2.3,     3.0,     3.7,     3.7,   12.0,  0.05997,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:52.003] simple1,        3645,     328,     113,     403,     0.2,     0.2,     0.7,     0.9,     1.1,     1.1,   12.0,  0.05997,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:52.003] total,          7391,     702,    9958,   10248,     0.8,     0.5,     1.9,     2.8,     3.7,     3.7,   12.0,  0.05997,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:53.002] insert,         4091,     345,    8880,    8880,     1.4,     1.3,     2.7,     3.8,     9.9,     9.9,   13.0,  0.05552,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:53.002] simple1,        3947,     302,     128,     379,     0.3,     0.2,     0.6,     0.8,     0.9,     0.9,   13.0,  0.05552,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:53.002] total,          8038,     647,    9008,    9259,     0.9,     0.6,     2.4,     3.1,     9.9,     9.9,   13.0,  0.05552,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:54.002] insert,         4354,     263,    7099,    7099,     1.9,     1.7,     3.5,     4.3,    12.8,    12.8,   14.0,  0.05236,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:54.002] simple1,        4200,     253,     103,     430,     0.4,     0.4,     0.8,     1.0,     1.3,     1.3,   14.0,  0.05236,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:54.002] total,          8554,     516,    7202,    7529,     1.1,     0.8,     3.0,     3.8,    12.8,    12.8,   14.0,  0.05236,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:55.002] insert,         4727,     373,    9270,    9270,     1.2,     1.2,     2.4,     3.8,     9.8,     9.8,   15.0,  0.04956,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:55.002] simple1,        4552,     352,     135,     487,     0.3,     0.2,     0.6,     0.8,     1.1,     1.1,   15.0,  0.04956,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:55.003] total,          9279,     725,    9405,    9757,     0.8,     0.5,     1.9,     2.8,     9.8,     9.8,   15.0,  0.04956,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:56.002] insert,         5049,     322,    7798,    7798,     1.4,     1.3,     2.7,     3.4,    11.2,    11.2,   16.0,  0.04648,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:56.002] simple1,        4976,     424,     180,     572,     0.3,     0.3,     0.7,     0.8,     1.0,     1.0,   16.0,  0.04648,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:56.002] total,         10025,     746,    7978,    8370,     0.8,     0.5,     2.3,     3.2,    11.2,    11.2,   16.0,  0.04648,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:57.002] insert,         5366,     317,    8128,    8128,     1.5,     1.4,     2.7,     3.4,    10.5,    10.5,   17.0,  0.04370,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:57.002] simple1,        5324,     348,     149,     590,     0.3,     0.2,     0.7,     0.9,     1.0,     1.0,   17.0,  0.04370,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:57.003] total,         10690,     665,    8277,    8718,     0.9,     0.6,     2.4,     3.2,    10.5,    10.5,   17.0,  0.04370,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:58.002] insert,         5698,     332,    8498,    8498,     1.5,     1.4,     2.8,     3.5,     7.9,     7.9,   18.0,  0.04123,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:58.002] simple1,        5534,     210,      97,     286,     0.4,     0.3,     0.8,     1.0,     7.8,     7.8,   18.0,  0.04123,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:58.002] total,         11232,     542,    8595,    8784,     1.0,     0.8,     2.6,     3.3,     7.9,     7.9,   18.0,  0.04123,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:59.002] insert,         6026,     328,    8293,    8293,     1.4,     1.4,     2.5,     3.2,     9.3,     9.3,   19.0,  0.03908,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:59.003] simple1,        5906,     372,     196,     744,     0.3,     0.2,     0.6,     0.8,     0.8,     0.8,   19.0,  0.03908,      0,      0,       0,       0,       0,       0
[2025-10-02 19:43:59.003] total,         11932,     700,    8489,    9037,     0.8,     0.5,     2.2,     2.8,     9.3,     9.3,   19.0,  0.03908,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:00.002] insert,         6369,     343,    8704,    8704,     1.4,     1.3,     2.5,     3.2,    10.0,    10.0,   20.0,  0.03716,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:00.003] simple1,        6132,     226,     121,     383,     0.3,     0.3,     0.8,     1.0,     1.4,     1.4,   20.0,  0.03716,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:00.004] total,         12501,     569,    8825,    9087,     1.0,     0.7,     2.4,     3.1,    10.0,    10.0,   20.0,  0.03716,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:01.002] insert,         6718,     349,    8895,    8895,     1.4,     1.3,     2.6,     3.7,     8.3,     8.3,   21.0,  0.03553,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:01.003] simple1,        6403,     271,     130,     478,     0.3,     0.2,     0.6,     0.9,     1.0,     1.0,   21.0,  0.03553,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:01.003] total,         13121,     620,    9025,    9373,     0.9,     0.7,     2.2,     3.0,     8.3,     8.3,   21.0,  0.03553,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:02.002] insert,         7032,     314,    8031,    8031,     1.5,     1.4,     2.9,     3.7,     8.5,     8.5,   22.0,  0.03391,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:02.002] simple1,        6706,     303,     155,     529,     0.3,     0.2,     0.7,     0.9,     1.2,     1.2,   22.0,  0.03391,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:02.002] total,         13738,     617,    8186,    8560,     0.9,     0.6,     2.4,     3.3,     8.5,     8.5,   22.0,  0.03391,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:03.008] insert,         7329,     297,    7706,    7706,     1.5,     1.3,     2.9,     3.9,     8.8,     8.8,   23.0,  0.03254,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:03.008] simple1,        7025,     319,     172,     510,     0.4,     0.3,     0.8,     1.0,     1.7,     1.7,   23.0,  0.03254,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:03.009] total,         14354,     616,    7878,    8216,     0.9,     0.6,     2.5,     3.3,     8.8,     8.8,   23.0,  0.03254,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:04.004] insert,         7629,     300,    7362,    7362,     1.6,     1.5,     3.1,     4.0,     9.6,     9.6,   24.0,  0.03157,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:04.004] simple1,        7234,     209,     115,     334,     0.3,     0.2,     0.8,     1.0,     1.1,     1.1,   24.0,  0.03157,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:04.005] total,         14863,     509,    7477,    7696,     1.1,     0.9,     2.9,     3.8,     9.6,     9.6,   24.0,  0.03157,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:05.002] insert,         7856,     227,    5659,    5659,     2.2,     1.8,     4.6,     6.0,     9.5,     9.5,   25.0,  0.03257,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:05.003] simple1,        7498,     264,     157,     478,     0.5,     0.3,     1.5,     2.4,     4.8,     4.8,   25.0,  0.03257,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:05.003] total,         15354,     491,    5816,    6137,     1.3,     0.7,     3.9,     5.5,     9.5,     9.5,   25.0,  0.03257,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:06.003] insert,         8200,     344,    8899,    8899,     1.3,     1.2,     2.5,     3.1,     7.3,     7.3,   26.0,  0.03148,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:06.003] simple1,        7814,     316,     179,     512,     0.3,     0.2,     0.7,     1.0,     5.2,     5.2,   26.0,  0.03148,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:06.003] total,         16014,     660,    9078,    9411,     0.8,     0.5,     2.1,     3.0,     7.3,     7.3,   26.0,  0.03148,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:07.001] insert,         8502,     302,    8035,    8035,     1.5,     1.4,     2.7,     3.5,     7.2,     7.2,   27.0,  0.03030,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:07.002] simple1,        8174,     360,     209,     726,     0.3,     0.2,     0.8,     1.0,     1.3,     1.3,   27.0,  0.03030,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:07.002] total,         16676,     662,    8244,    8761,     0.8,     0.5,     2.3,     3.1,     7.2,     7.2,   27.0,  0.03030,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:08.002] insert,         8757,     255,    6706,    6706,     1.7,     1.6,     3.4,     4.5,     5.9,     5.9,   28.0,  0.02975,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:08.003] simple1,        8417,     243,     149,     561,     0.5,     0.4,     1.0,     1.5,    15.3,    15.3,   28.0,  0.02975,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:08.003] total,         17174,     498,    6855,    7267,     1.1,     0.7,     3.0,     4.5,    15.3,    15.3,   28.0,  0.02975,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:09.001] insert,         9062,     305,    7579,    7579,     1.6,     1.5,     3.1,     3.5,    11.4,    11.4,   29.0,  0.02879,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:09.002] simple1,        8635,     218,     135,     511,     0.4,     0.3,     0.8,     1.1,     1.2,     1.2,   29.0,  0.02879,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:09.002] total,         17697,     523,    7714,    8090,     1.1,     0.8,     2.7,     3.4,    11.4,    11.4,   29.0,  0.02879,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:10.003] insert,         9368,     306,    7790,    7790,     1.4,     1.3,     2.5,     3.6,     8.0,     8.0,   30.0,  0.02783,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:10.004] simple1,        8959,     324,     193,     600,     0.3,     0.2,     0.7,     0.9,     1.2,     1.2,   30.0,  0.02783,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:10.004] total,         18327,     630,    7983,    8390,     0.8,     0.6,     2.3,     3.0,     8.0,     8.0,   30.0,  0.02783,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:11.002] insert,         9627,     259,    6776,    6776,     1.8,     1.7,     3.3,     4.1,     4.7,     4.7,   31.0,  0.02744,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:11.002] simple1,        9183,     224,     149,     461,     0.4,     0.4,     0.9,     1.1,     1.9,     1.9,   31.0,  0.02744,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:11.002] total,         18810,     483,    6925,    7237,     1.2,     0.9,     3.0,     3.9,     4.7,     4.7,   31.0,  0.02744,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:12.001] insert,         9969,     342,    8459,    8459,     1.3,     1.2,     2.5,     3.3,     8.3,     8.3,   32.0,  0.02668,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:12.001] simple1,        9578,     395,     255,     772,     0.2,     0.2,     0.6,     0.8,     0.8,     0.8,   32.0,  0.02668,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:12.002] total,         19547,     737,    8714,    9231,     0.7,     0.5,     2.0,     3.0,     8.3,     8.3,   32.0,  0.02668,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:13.003] insert,        10284,     315,    8057,    8057,     1.4,     1.3,     2.5,     2.9,     7.7,     7.7,   33.0,  0.02587,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:13.003] simple1,        9929,     351,     214,     648,     0.3,     0.2,     0.7,     0.9,     1.2,     1.2,   33.0,  0.02587,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:13.004] total,         20213,     666,    8271,    8705,     0.8,     0.5,     2.1,     2.8,     7.7,     7.7,   33.0,  0.02587,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:14.002] insert,        10613,     329,    8573,    8573,     1.3,     1.3,     2.4,     2.6,    10.6,    10.6,   34.0,  0.02520,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:14.002] simple1,       10269,     340,     220,     668,     0.3,     0.2,     0.6,     0.8,     0.9,     0.9,   34.0,  0.02520,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:14.003] total,         20882,     669,    8793,    9241,     0.8,     0.5,     2.1,     2.5,    10.6,    10.6,   34.0,  0.02520,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:15.005] insert,        10949,     336,    8194,    8194,     1.3,     1.2,     2.4,     3.1,     7.4,     7.4,   35.0,  0.02451,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:15.006] simple1,       10619,     350,     240,     832,     0.3,     0.2,     0.7,     0.9,     1.2,     1.2,   35.0,  0.02451,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:15.006] total,         21568,     686,    8434,    9026,     0.8,     0.5,     2.1,     2.7,     7.4,     7.4,   35.0,  0.02451,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:16.002] insert,        11294,     345,    9021,    9021,     1.2,     1.2,     2.2,     3.5,    10.5,    10.5,   36.0,  0.02416,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:16.003] simple1,       11009,     390,     256,     832,     0.2,     0.2,     0.6,     0.8,     1.7,     1.7,   36.0,  0.02416,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:16.003] total,         22303,     735,    9277,    9853,     0.7,     0.5,     1.9,     2.8,    10.5,    10.5,   36.0,  0.02416,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:17.002] insert,        11660,     366,    9186,    9186,     1.1,     1.0,     2.0,     2.9,     8.0,     8.0,   37.0,  0.02404,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:17.002] simple1,       11460,     451,     331,    1104,     0.2,     0.1,     0.5,     0.7,     0.8,     0.8,   37.0,  0.02404,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:17.003] total,         23120,     817,    9517,   10290,     0.6,     0.3,     1.8,     2.3,     8.0,     8.0,   37.0,  0.02404,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:18.002] insert,        11974,     314,    8022,    8022,     1.3,     1.3,     2.6,     3.1,     8.7,     8.7,   38.0,  0.02340,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:18.002] simple1,       11793,     333,     226,     627,     0.3,     0.2,     0.7,     0.8,     0.9,     0.9,   38.0,  0.02340,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:18.002] total,         23767,     647,    8248,    8649,     0.8,     0.5,     2.1,     2.8,     8.7,     8.7,   38.0,  0.02340,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:19.002] insert,        12309,     335,    8709,    8709,     1.2,     1.1,     2.4,     3.1,     3.9,     3.9,   39.0,  0.02293,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:19.002] simple1,       12206,     413,     298,     848,     0.2,     0.2,     0.5,     0.7,     9.9,     9.9,   39.0,  0.02293,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:19.003] total,         24515,     748,    9007,    9557,     0.7,     0.4,     1.9,     2.7,     9.9,     9.9,   39.0,  0.02293,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:20.001] insert,        12521,     212,    5509,    5509,     2.2,     1.7,     4.8,     7.3,     9.5,     9.5,   40.0,  0.02353,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:20.001] simple1,       12450,     244,     182,     688,     0.4,     0.3,     0.9,     1.9,     2.0,     2.0,   40.0,  0.02353,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:20.002] total,         24971,     456,    5691,    6197,     1.2,     0.6,     4.0,     5.8,     9.5,     9.5,   40.0,  0.02353,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:21.002] insert,        12891,     370,    9752,    9752,     1.1,     1.0,     1.9,     2.7,     9.5,     9.5,   41.0,  0.02366,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:21.002] simple1,       12837,     387,     293,     977,     0.2,     0.1,     0.4,     0.7,     0.9,     0.9,   41.0,  0.02366,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:21.002] total,         25728,     757,   10045,   10729,     0.6,     0.4,     1.6,     2.4,     9.5,     9.5,   41.0,  0.02366,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:22.003] insert,        13213,     322,    8074,    8074,     1.3,     1.2,     2.6,     3.1,     3.6,     3.6,   42.0,  0.02309,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:22.004] simple1,       13138,     301,     225,     848,     0.3,     0.3,     0.7,     0.9,     3.8,     3.8,   42.0,  0.02309,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:22.004] total,         26351,     623,    8299,    8922,     0.8,     0.6,     2.2,     3.1,     3.8,     3.8,   42.0,  0.02309,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:23.002] insert,        13528,     315,    8400,    8400,     1.3,     1.2,     2.5,     2.9,    10.6,    10.6,   43.0,  0.02258,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:23.003] simple1,       13458,     320,     234,     735,     0.2,     0.2,     0.5,     0.7,     0.8,     0.8,   43.0,  0.02258,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:23.003] total,         26986,     635,    8634,    9135,     0.8,     0.5,     2.1,     2.9,    10.6,    10.6,   43.0,  0.02258,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:24.002] insert,        13876,     348,    8497,    8497,     1.2,     1.1,     2.1,     2.5,     6.0,     6.0,   44.0,  0.02210,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:24.002] simple1,       13758,     300,     229,     795,     0.3,     0.2,     0.6,     0.9,     1.2,     1.2,   44.0,  0.02210,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:24.003] total,         27634,     648,    8726,    9292,     0.8,     0.6,     1.8,     2.5,     6.0,     6.0,   44.0,  0.02210,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:25.002] insert,        14192,     316,    7808,    7808,     1.3,     1.3,     2.2,     3.3,     9.0,     9.0,   45.0,  0.02161,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:25.002] simple1,       14026,     268,     218,     750,     0.3,     0.2,     0.7,     0.9,     1.1,     1.1,   45.0,  0.02161,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:25.003] total,         28218,     584,    8026,    8558,     0.9,     0.6,     2.1,     2.9,     9.0,     9.0,   45.0,  0.02161,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:26.002] insert,        14536,     344,    8634,    8634,     1.2,     1.2,     2.0,     2.5,     3.0,     3.0,   46.0,  0.02117,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:26.002] simple1,       14321,     295,     230,     678,     0.3,     0.2,     0.6,     0.9,     6.6,     6.6,   46.0,  0.02117,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:26.002] total,         28857,     639,    8864,    9312,     0.8,     0.6,     1.9,     2.5,     6.6,     6.6,   46.0,  0.02117,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:27.001] insert,        14896,     360,    9002,    9002,     1.1,     1.1,     2.0,     2.6,     2.8,     2.8,   47.0,  0.02079,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:27.001] simple1,       14602,     281,     222,     576,     0.2,     0.2,     0.6,     0.9,     0.9,     0.9,   47.0,  0.02079,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:27.001] total,         29498,     641,    9224,    9578,     0.7,     0.6,     1.8,     2.4,     2.8,     2.8,   47.0,  0.02079,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:28.002] insert,        15239,     343,    8565,    8565,     1.2,     1.1,     2.1,     2.7,     5.2,     5.2,   48.0,  0.02039,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:28.002] simple1,       14986,     384,     304,     803,     0.3,     0.2,     0.6,     0.8,     0.9,     0.9,   48.0,  0.02039,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:28.002] total,         30225,     727,    8869,    9368,     0.7,     0.5,     1.8,     2.5,     5.2,     5.2,   48.0,  0.02039,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:29.001] insert,        15531,     292,    7408,    7408,     1.4,     1.3,     2.6,     3.9,     4.1,     4.1,   49.0,  0.02004,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:29.001] simple1,       15302,     316,     240,     721,     0.3,     0.2,     0.7,     0.9,     6.8,     6.8,   49.0,  0.02004,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:29.002] total,         30833,     608,    7648,    8129,     0.8,     0.6,     2.3,     3.4,     6.8,     6.8,   49.0,  0.02004,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:30.001] insert,        15906,     375,    9433,    9433,     1.0,     1.0,     1.8,     2.3,    12.6,    12.6,   50.0,  0.01999,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:30.002] simple1,       15668,     366,     295,     980,     0.2,     0.1,     0.5,     0.8,     0.9,     0.9,   50.0,  0.01999,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:30.002] total,         31574,     741,    9728,   10413,     0.6,     0.4,     1.6,     2.0,    12.6,    12.6,   50.0,  0.01999,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:31.002] insert,        16276,     370,    8859,    8859,     1.1,     1.0,     1.9,     3.2,     9.2,     9.2,   51.0,  0.01973,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:31.002] simple1,       16020,     352,     294,     989,     0.2,     0.1,     0.5,     0.9,     1.2,     1.2,   51.0,  0.01973,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:31.002] total,         32296,     722,    9153,    9848,     0.7,     0.4,     1.7,     2.3,     9.2,     9.2,   51.0,  0.01973,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:32.002] insert,        16591,     315,    8233,    8233,     1.2,     1.2,     2.4,     3.0,     3.9,     3.9,   52.0,  0.01936,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:32.002] simple1,       16390,     370,     294,     979,     0.3,     0.2,     0.6,     0.9,     1.1,     1.1,   52.0,  0.01936,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:32.002] total,         32981,     685,    8527,    9212,     0.7,     0.5,     1.9,     2.7,     3.9,     3.9,   52.0,  0.01936,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:33.001] insert,        16939,     348,    8708,    8708,     1.1,     1.1,     1.9,     2.4,     2.8,     2.8,   53.0,  0.01904,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:33.002] simple1,       16719,     329,     270,     809,     0.3,     0.2,     0.7,     0.9,    10.7,    10.7,   53.0,  0.01904,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:33.002] total,         33658,     677,    8978,    9517,     0.7,     0.5,     1.7,     2.4,    10.7,    10.7,   53.0,  0.01904,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:34.002] insert,        17258,     319,    8231,    8231,     1.3,     1.2,     2.4,     3.1,     4.0,     4.0,   54.0,  0.01869,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:34.002] simple1,       17024,     305,     266,     914,     0.2,     0.2,     0.5,     0.7,     0.9,     0.9,   54.0,  0.01869,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:34.002] total,         34282,     624,    8497,    9145,     0.8,     0.5,     2.0,     3.0,     4.0,     4.0,   54.0,  0.01869,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:35.002] insert,        17479,     221,    5523,    5523,     2.0,     1.7,     4.5,     5.5,     8.5,     8.5,   55.0,  0.01936,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:35.002] simple1,       17187,     163,     144,     394,     0.4,     0.3,     0.9,     1.6,     1.9,     1.9,   55.0,  0.01936,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:35.002] total,         34666,     384,    5667,    5917,     1.3,     1.0,     3.8,     5.3,     8.5,     8.5,   55.0,  0.01936,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:36.002] insert,        17827,     348,    8973,    8973,     1.1,     1.1,     1.9,     2.5,     7.9,     7.9,   56.0,  0.01910,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:36.002] simple1,       17506,     319,     267,     774,     0.2,     0.1,     0.5,     0.7,     0.8,     0.8,   56.0,  0.01910,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:36.003] total,         35333,     667,    9240,    9747,     0.7,     0.5,     1.7,     2.4,     7.9,     7.9,   56.0,  0.01910,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:37.002] insert,        18142,     315,    7970,    7970,     1.2,     1.2,     2.1,     2.7,    12.9,    12.9,   57.0,  0.01876,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:37.002] simple1,       17817,     311,     260,     941,     0.3,     0.2,     0.7,     0.9,     1.1,     1.1,   57.0,  0.01876,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:37.003] total,         35959,     626,    8230,    8911,     0.8,     0.5,     1.9,     2.6,    12.9,    12.9,   57.0,  0.01876,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:38.002] insert,        18475,     333,    8312,    8312,     1.2,     1.2,     2.0,     2.7,    10.0,    10.0,   58.0,  0.01844,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:38.003] simple1,       18130,     313,     271,     905,     0.2,     0.2,     0.6,     0.8,     0.9,     0.9,   58.0,  0.01844,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:38.003] total,         36605,     646,    8583,    9217,     0.7,     0.5,     1.8,     2.1,    10.0,    10.0,   58.0,  0.01844,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:39.002] insert,        18764,     289,    7506,    7506,     1.4,     1.3,     2.4,     3.5,     8.9,     8.9,   59.0,  0.01814,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:39.003] simple1,       18517,     387,     332,    1116,     0.3,     0.2,     0.7,     0.9,     1.6,     1.6,   59.0,  0.01814,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:39.003] total,         37281,     676,    7838,    8622,     0.7,     0.5,     2.1,     2.9,     8.9,     8.9,   59.0,  0.01814,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:40.002] insert,        19029,     265,    6882,    6882,     1.5,     1.4,     2.8,     3.3,     3.7,     3.7,   60.0,  0.01794,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:40.003] simple1,       18841,     324,     276,     925,     0.3,     0.2,     0.8,     1.0,    12.5,    12.5,   60.0,  0.01794,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:40.003] total,         37870,     589,    7158,    7807,     0.9,     0.5,     2.5,     3.2,    12.5,    12.5,   60.0,  0.01794,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:40.068] insert,        19041,     180,    4893,    4893,     2.2,     2.1,     5.7,     5.7,     5.7,     5.7,   60.1,  0.01824,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:40.069] simple1,       18864,     344,     299,    1002,     0.4,     0.3,     0.7,     0.7,     0.7,     0.7,   60.1,  0.01824,      0,      0,       0,       0,       0,       0
[2025-10-02 19:44:40.069] total,         37905,     524,    5192,    5895,     1.0,     0.4,     2.5,     5.7,     5.7,     5.7,   60.1,  0.01824,      0,      0,       0,       0,       0,       0


[2025-10-02 19:44:40.069] Results:
[2025-10-02 19:44:40.076] Op rate                   :      631 op/s  [insert: 317 op/s, simple1: 314 op/s]
[2025-10-02 19:44:40.076] Partition rate            :    8,270 pk/s  [insert: 8,085 pk/s, simple1: 186 pk/s]
[2025-10-02 19:44:40.076] Row rate                  :    8,689 row/s [insert: 8,085 row/s, simple1: 604 row/s]
[2025-10-02 19:44:40.078] Latency mean              :    0.9 ms [insert: 1.4 ms, simple1: 0.3 ms]
[2025-10-02 19:44:40.078] Latency median            :    0.6 ms [insert: 1.3 ms, simple1: 0.2 ms]
[2025-10-02 19:44:40.078] Latency 95th percentile   :    2.3 ms [insert: 2.7 ms, simple1: 0.8 ms]
[2025-10-02 19:44:40.078] Latency 99th percentile   :    3.4 ms [insert: 4.0 ms, simple1: 1.1 ms]
[2025-10-02 19:44:40.078] Latency 99.9th percentile :    8.5 ms [insert: 9.5 ms, simple1: 2.6 ms]
[2025-10-02 19:44:40.078] Latency max               :   28.9 ms [insert: 20.5 ms, simple1: 28.9 ms]
[2025-10-02 19:44:40.078] Total partitions          :    496,766 [insert: 485,622, simple1: 11,144]
[2025-10-02 19:44:40.078] Total errors              :          0 [insert: 0, simple1: 0]
[2025-10-02 19:44:40.078] Total GC count            : 0
[2025-10-02 19:44:40.079] Total GC memory           : 0.000 KiB
[2025-10-02 19:44:40.079] Total GC time             :    0.0 seconds
[2025-10-02 19:44:40.079] Avg GC time               :    NaN ms
[2025-10-02 19:44:40.079] StdDev GC time            :    0.0 ms
[2025-10-02 19:44:40.090] Total operation time      : 00:01:00

[2025-10-02 19:44:40.090] END